/* 
- переробити test-set заголовок
- перевести слайдер на основну сторінку
- відображати час на тест
- номер тесту на відповідях
- колір відсотку в залежності від результату

- запис результату, відображення статистики, порівняння з попередніми спробами
- діалогові вікна в дівах - "такий користувач вже існує"
- зробити меню з делегуванням подій
- підготувати план розповіді про свій проект

- Зробити тултіпи на кнопки?? 
- переробити файли з даними з JS на JSON ??
- додати прогрес на тести ???
*/

/*correct color
background-color: rgba(167, 219, 124, 0.719);
incorrect
rgba(245, 183, 158, 0.753);*/

'Segoe UI', Tahoma, Geneva, Verdana, sans-serif;
'Gill Sans', 'Gill Sans MT', Calibri, 'Trebuchet MS', sans-serif;







