/* 
- відображати час на тест
-розбити на побільше компонентів
- зробити файли для всіх тестів
- чортов слайдер
- створювати об'єкт з тестами з правильними відповідями і виводи в кінці їх

- замість кнопки "наступний тест" клацання чисто по варіантах, через setTimeout
    на інший тест
- так щоб тест крутився вниз, а задній фон стояв
- запис результату, відображення статистики, порівняння з попередніми спробами
- діалогові вікна в дівах - "такий користувач вже існує"
- зробити меню з делегуванням подій
- підготувати план розповіді про свій проект


- об'єкт підтягнутий з LocalStorage тримати під рукою як перемінну у якомусь JavaScript файлі
- Зробити тултіпи на кнопки?? 
- переробити файли з даними з JS на JSON ??
- додати прогрес на тести ???
*/

/*correct color
background-color: rgba(167, 219, 124, 0.719);
incorrect
rgba(245, 183, 158, 0.753);*/

'Segoe UI', Tahoma, Geneva, Verdana, sans-serif;
'Gill Sans', 'Gill Sans MT', Calibri, 'Trebuchet MS', sans-serif;







