import agroregions from '../assets/images/tests/geography/agroregions.jpg';
import animals from '../assets/images/tests/geography/animals.jpg';
import demography from '../assets/images/tests/geography/demography.jpg';
import industry from '../assets/images/tests/geography/industry.jpg';
import rivers from '../assets/images/tests/geography/rivers.jpg';
import soil from '../assets/images/tests/geography/soil.jpg';
import tree from '../assets/images/tests/geography/tree.jpg';
import world from '../assets/images/tests/geography/world.jpg';

// Correct answer goes first
let geography = [
  {
    question: 'Які наукові наслідки Першої навколосвітньої подорожі?',
    answers: [
      'доведено, що Земля має форму кулі, а всі океани сполучені між собою',
      'виявлено, що на Землі площа суходолу більша, ніж поверхні океанів',
      'досягнуто точки Північного полюса й узбережжя Антарктиди',
      'підтверджено існування шести материків і чотирьох океанів',
    ],
  },
  {
    question: 'Яка форма рельєфу утворюється в результаті дії зовнішніх сил, описаних в уривку з художнього твору: «Навесні в борозну ринув каламутний потік талої води. Він мчав схилом униз, поглиблюючи вибоїну, розмиваючи її, підточуючи її стінки, забираючи з собою часом цілі брили землі»?',
    answers: [
      'яр',
      'печера',
      'річкова долина',
      'улоговина видування',
    ],
  },
  {
    question: 'Сила вітру залежить від',
    answers: [
      'різниці атмосферного тиску',
      'відносної висоти місцевості',
      'віддаленості суходолу від океану',
      'прозорості атмосфери',
    ],
  },
  {
    question: 'Доберіть назву до картосхеми України.',
    imageSrc: rivers,
    imageAlt: 'річки України на карті',
    answers: [
      '«Басейни річок»',
      '«Долини річок»',
      '«Типи живлення річок»',
      '«Густота річкової мережі»',
    ],
  },
  {
    question: 'У Тихому океані знаходиться',
    answers: [
      'Маріанський жолоб',
      'Гвінейська затока',
      'хребет Ломоносова',
      'Аравійське море',
    ],
  },
  {
    question: 'Визначте подібні риси рельєфу Південної Америки та Північної Америки.',
    answers: [
      'на заході простягаються високі гори, на сході переважають рівнини',
      'із заходу на схід низовини переходять у височини та високі нагір’я',
      'домінують плоскогір’я, гори простягаються в широтному напрямку',
      'переважають низовини, розмежовані низькими гірськими хребтами',
    ],
  },
  {
    question: 'В Австралії боксити залягають на поверхні потужними пластами (до 10 м). Визначте особливості розроблення цих родовищ.',
    answers: [
      'великі кар’єри, низькі затрати',
      'глибокі рудники, значна капіталомісткість',
      'автоматизовані шахти, загроза землетрусів',
      'свердловини, високий рівень безпеки',
    ],
  },
  {
    question: 'Річки басейну Північного Льодовитого океану протікають у помірному та субарктичному кліматичних поясах. Який наслідок такого положення й напрямку течії цих річок?',
    answers: [
      'тривала весняна повінь, спочатку у верхній течії, потім - у нижній',
      'переважно рівнинний характер течії, місцями - пороги в руслах',
      'паводковий режим річок, часто з катастрофічними наслідками',
      'льодостав у верхній течії, можливість цілорічної навігації - у нижній',
    ],
  },
  {
    question: 'Яка природна зона в Євразії та в Північній Америці простягається суцільною смугою із заходу на схід, перериваючись лише в гірських районах?',
    answers: [
      'тайга',
      'мусонні ліси',
      'савани й рідколісся',
      'вічнозелені твердолисті ліси й чагарники',
    ],
  },
  {
    question: 'Природні пустелі й напівпустелі за кліматичними показниками займають приблизно 33 % поверхні материків, а пустельні ландшафти за характером рослинного й ґрунтового покриву - 43 %. Що спричинило велику різницю між площею пустельних ландшафтів і площею природних пустель?',
    answers: [
      'спустелення в посушливих районах',
      'yтворення оазисів у пустелях',
      'крапельне зрошення в пустелях',
      'заліснення земель у напівпустелях',
    ],
  },
  {
    question: 'На політичній карті світу Україна',
    answers: [
      'унітарна держава, частина території якої є тимчасово окупованою',
      'федеративна держава, яка має у своєму складі самоврядні території',
      'союзна держава, до складу якої входять автономні землі, краї',
      'держава-конфедерація, членів якої можна вважати суверенними',
    ],
  },
  {
    question: 'Укажіть тектонічну структуру на території України, у межах якої кристалічні породи докембрію (гнейси, граніти тощо) виходять на поверхню найчастіше у вигляді природних відслонень у долинах річок.',
    answers: [
      'Український щит',
      'Передкарпатський прогин',
      'Донецька складчаста споруда',
      'Причорноморська западина',
    ],
  },
  {
    question: 'Що зумовлює меншу кількість сумарної сонячної радіації в західних областях України порівняно з розташованими на тих самих широтах східними областями?',
    answers: [
      'більше хмарних днів протягом року',
      'менший кут падіння сонячного проміння',
      'менша тривалість світлового дня',
      'більша запиленість атмосфери',
    ],
  },
  {
    question: 'Які зміни в природі могли б зумовити утворення льодовиків в Українських Карпатах?',
    answers: [
      'зниження середньорічної температури повітря, збільшення висоти гір',
      'посилення впливу циклонів, прискорення процесу руйнування гір',
      'збільшення кількості опадів, зменшення поверхневого стоку',
      'зменшення частоти сейсмічних явищ, знелісення гірських схилів',
    ],
  },
  {
    question: 'Проаналізуйте поширення зональних типів ґрунтів в одній з областей України. Які основні типи рослинності зумовили процеси ґрунтоутворення в цій місцевості?',
    imageSrc: soil,
    imageAlt: 'Грунти України',
    answers: [
      'справжні й полиново-типчакові степи',
      'соснові та ялинові ліси, гірські луки',
      'мішані ліси, заплавні луки',
      'дубово-грабові ліси, лучні степи',
    ],
  },
  {
    question: 'Опадів на Волині випадає стільки само, як у багатьох посушливих районах материка. Чому в цьому регіоні України сформувалися ландшафти мішаних лісів, а не степу?',
    answers: [
      'менше випаровування є причиною надмірного зволоження території',
      'відклади морени зумовлюють бідний мінеральний склад ґрунтів',
      'через недостатню кількість тепла не ростуть трав’янисті рослини',
      'домінування циклонів зумовлює холодні зими без снігового покриву',
    ],
  },
  {
    question: 'За добіркою поштових марок розпізнайте природоохоронний об’єкт України.',
    imageSrc: animals,
    imageAlt: 'Тварини україніських заповідників',
    answers: [
      'Шацький національний природний парк',
      'національний природний парк «Гуцульщина»',
      'Карпатський біосферний заповідник',
      'Український степовий заповідник',
    ],
  },
  {
    question: 'Проаналізуйте графічну модель демографічних процесів в Україні протягом 1965-2015 рр. Визначте особливість динаміки руху населення протягом останніх 15 років порівняно з попереднім періодом.',
    imageSrc: demography,
    imageAlt: 'Демографічна ситуація в Україні в таблиці',
    answers: [
      'сповільнюється темп скорочення населення',
      'почався перехід до першого типу відтворення населення',
      'утримується на одному рівні сальдо міграцій',
      'з’являються перші ознаки демографічної кризи',
    ],
  },
  {
    question: 'Що зумовило формування найбільшого в Україні Придніпровського району чорної металургії?',
    answers: [
      'освоєння родовищ залізної та марганцевої руди',
      'прикордонне розташування району на сході країни',
      'відкриття вугільного басейну на Правобережжі',
      'будівництво штучного каналу «Дніпро - Донбас»',
    ],
  },
  {
    question: 'На картосхемі України позначено розташування найбільших',
    imageSrc: industry,
    imageAlt: 'Промислові вузли на карті України',
    answers: [
      'атомних та гідравлічних електростанцій',
      'центрів важкого машинобудування',
      'кам’яновугільних та буровугільних шахт',
      'центрів чорної та кольорової металургії',
    ],
  },
  {
    question: 'Молочноконсервні заводи в Україні розташовані переважно в малих містах (Куп’янську, Ічні, Овручі, Літині, Тульчині тощо) тому, що вони',
    answers: [
      'зорієнтовані на райони концентрації виробників сировини',
      'належать до групи екологічно небезпечних виробництв',
      'тяжіють до міст, які є великими транспортними вузлами',
      'створюють велике навантаження на інфраструктуру міст',
    ],
  },
  {
    question: 'Компанія «Авіалінії Антонова» здійснює понад 35 % перевезень великогабаритних і надважких вантажів на світовому ринку, є офіційним перевізником ООН. Що зумовлює високу конкурентність цієї компанії?',
    answers: [
      'парк унікальних транспортних літаків українського виробництва',
      'вигідне розташування бази авіакомпанії в столичному регіоні',
      'високотехнологічне обладнання всіх українських аеродромів',
      'світове лідерство компанії за кількістю вантажних і пасажирських літаків',
    ],
  },
  {
    question: 'За роки роботи в Україні іноземна компанія запустила виробництво своєї продукції на двох великих заводах - у м. Бориспіль (Київська область) та м. Покров (Дніпропетровська область). Товари побутової хімії та засоби гігієни, вироблені на цих підприємствах, реалізують в Україні та експортують у різні країни світу. Які чинники зумовили розташування цих підприємств?',
    answers: [
      'транспортно-географічне положення міст, ціна робочої сили',
      'адміністративна функція міст, велика кількість населення',
      'можливості кооперування в межах міської агломерації, водні ресурси',
      'концентрація важкої промисловості в містах, екологічні проблеми',
    ],
  },
  {
    question: 'Проаналізуйте відображені на картограмі регіональні відмінності обсягів виробництва певного виду сільськогосподарської продукції та визначте цей вид продукції.',
    imageSrc: agroregions,
    imageAlt: 'Регіональні розташування агрокультур',
    answers: [
      'соняшникове насіння',
      'цукровий буряк',
      'зерно кукурудзи',
      'картопля',
    ],
  },
  {
    question: 'Укажіть область, територією якої пролягає туристичний маршрут «Білгород-Дністровська (Аккерманська) фортеця - порт Ізмаїл - рисові чеки на околицях Кілії- єрики «Української Венеції» (м. Вилково) - Центр культури вина «Шабо».',
    answers: [
      'Одеська',
      'Миколаївська',
      'Запорізька',
      'Херсонська',
    ],
  },
  {
    question: 'Найпоширеніший на політичній карті світу тип держави',
    answers: [
      'республіка',
      'федерація',
      'монархія',
      'конфедерація',
    ],
  },
  {
    question: 'Яку інформацію необхідно додати до наведеної в таблиці, щоб порівняти забезпеченість ріллею в Україні та Китаї?',
    answers: [
      'кількість населення (млн осіб)',
      'обсяг ВВП або ВНП (млрд у. о.)',
      'площу пасовищ і сінокосів (млн га)',
      'середній вік населення (років)',
    ],
  },
  {
    question: 'На картосхемі темним кольором позначено десять країн-лідерів за обсягом',
    imageSrc: world,
    imageAlt: 'Промисловий видобуток у світі',
    answers: [
      'виплавки чорнової міді',
      'виплавки сталі',
      'видобутку кам’яного вугілля',
      'розвіданих запасів нафти',
    ],
  },
  {
    question: 'Яка тенденція характерна для розміщення виробництва морських суден у світі?',
    answers: [
      'зміщення в Азію (Китай, Республіка Корея, Японія)',
      'концентрація в Західній Європі (Греція, Іспанія, Данія)',
      'збільшення відриву Америки (США, Канада) від решти країн світу',
      'зосередження в нових індустріальних країнах Америки (Бразилія, Аргентина)',
    ],
  },
  {
    question: 'Укажіть основну причину зменшення протягом останніх десятиліть упливу сировинного чинника на розташування матеріаломістких виробництв у США.',
    answers: [
      'стрімкий розвиток транспорту',
      'збільшення дефіциту трудових ресурсів',
      'прискорення темпів індустріалізації',
      'зростання вартості енергоносіїв',
    ],
  },
  {
    question: 'Що зумовило збільшення в структурі експорту Індії частки машин, устаткування, програмного забезпечення?',
    answers: [
      'зростання рівня кваліфікації робочої сили',
      'розвиток кустарно-ремісничого виробництва',
      'збільшення обсягів видобування рудної сировини',
      'поліпшення географічного положення країни',
    ],
  },
  {
    question: 'Виникнення глобальних екологічних проблем зумовлено передусім нехтуванням людством такої закономірності розвитку географічної оболонки, як',
    answers: [
      'цілісність',
      'ритмічність',
      'широтна зональність',
      'висотна поясність',
    ],
  },
  {
    question: 'Яке значення морських експедицій, очолюваних Х. Колумбом?',
    answers: [
      'відкрито нову частину світу для європейців',
      'прокладено морський шлях з Європи до Індії',
      'створено першу карту шести континентів',
      'пройдено каналом з Атлантики в Тихий океан',
    ],
  },
  {
    question: 'У північній частині якого материка неможливо побачити Полярну зірку?',
    answers: [
      'Австралії',
      'Євразії',
      'Північної Америки',
      'Африки',
    ],
  },
  {
    question: 'Укажіть головну причину утворення й сучасного розташування материків та океанів.',
    answers: [
      'рух літосферних плит',
      'процеси метаморфізації в літосфері',
      'коливальні рухи земної кори',
      'виверження вулканів',
    ],
  },
  {
    question: 'Червоне море є внутрішнім, знаходиться між тропічними пустелями, у нього не впадає жодна річка. Чому воно не може випаруватися і висохнути?',
    answers: [
      'сполучене протокою з Індійським океаном',
      'отримує ропу з Мертвого моря',
      'поповнюється підземними джерелами',
      'знаходиться в тектонічному розломі',
    ],
  },
  {
    question: 'Як називають підземні води, що навесні можуть з’являтися в підвалах будинків, погребах?',
    answers: [
      'ґрунтові',
      'термальні',
      'артезіанські',
      'міжпластові',
    ],
  },
  {
    question: 'Яку закономірність географічної оболонки відображено на рисунку?',
    imageSrc: tree,
    imageAlt: 'Дерева в різні пори року',
    answers: [
      'ритмічність',
      'цілісність',
      'висотну поясність',
      'широтну зональність',
    ],
  },
  {
    question: 'Яку область земної кулі називають Антарктикою?',
    answers: [
      'Антарктиду разом з прибережними водами та прилеглими островами',
      'сукупність усіх островів материкового походження навколо Антарктиди',
      'центральну частину Антарктиди з найнижчими температурами повітря',
      'прибережні води Світового океану навколо Антарктиди',
    ],
  },
  {
    question: 'Чому Австралію можна назвати «Європою навпаки»?',
    answers: [
      'на півночі континенту тепліше, ніж на півдні',
      'у тектонічній будові материка немає платформи',
      'річки завжди повноводні, а опадів випадає менше',
      'збереглися різні види копитних і хижих тварин',
    ],
  },
];
    
export { geography };