// Перша відповідь правильна всередині масиву

let history = [
    {
        question: 'Які наукові наслідки Першої навколосвітньої подорожі?',
        answers: [
            'доведено, що Земля має форму кулі, а всі океани сполучені між собою',
            'виявлено, що на Землі площа суходолу більша, ніж поверхні океанів',
            'досягнуто точки Північного полюса й узбережжя Антарктиди',
            'підтверджено існування шести материків і чотирьох океанів'
        ]
    },
    {
        question: 'Яка форма рельєфу утворюється в результаті дії зовнішніх сил, описаних в уривку з художнього твору: «Навесні в борозну ринув каламутний потік талої води. Він мчав схилом униз, поглиблюючи вибоїну, розмиваючи її, підточуючи її стінки, забираючи з собою часом цілі брили землі»?',
        answers: [
            'яр',
            'печера',
            'річкова долина',
            'улоговина видування'
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: 'Які наукові наслідки Першої навколосвітньої подорожі?',
        answers: [
            'доведено, що Земля має форму кулі, а всі океани сполучені між собою',
            'виявлено, що на Землі площа суходолу більша, ніж поверхні океанів',
            'досягнуто точки Північного полюса й узбережжя Антарктиди',
            'підтверджено існування шести материків і чотирьох океанів'
        ]
    },
    {
        question: 'Яка форма рельєфу утворюється в результаті дії зовнішніх сил, описаних в уривку з художнього твору: «Навесні в борозну ринув каламутний потік талої води. Він мчав схилом униз, поглиблюючи вибоїну, розмиваючи її, підточуючи її стінки, забираючи з собою часом цілі брили землі»?',
        answers: [
            'яр',
            'печера',
            'річкова долина',
            'улоговина видування'
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    },
    {
        question: '',
        answers: [
            '',
            '',
            '',
            ''
        ]
    }
]
    
    export { history };