// Перша відповідь правильна всередині масиву

let law = [
    {
        question: 'Стаття 18 Закону України «Про громадянство України» встановлює, що вихід дітей віком від 14 до 18 років з громадянства України може відбуватися лише за їхньою згодою. Якою є вказана норма за характером втіленого припису?',
        answers: [
            'Імперативна.',
            'Диспозитивна.',
            'Охоронна.',
            'Дозвільна.'
        ]
    },
    {
        question: 'З якого моменту стає громадянином України повнолітня особа - особа без громадянства, що постійно проживає на території України і яку усиновили громадяни України?',
        answers: [
            'Набрання чинності рішенням суду про усиновлення.',
            'Реєстрації громадянства.',
            'Видачі нового свідоцтва про народження.',
            'Початку процедури усиновлення.'
        ]
    },
    {
        question: 'Якою є мінімальна кількість засновників громадського об’єднання?',
        answers: [
            'Двоє осіб.',
            'Сто осіб.',
            'Десять осіб.',
            'Сім осіб.'
        ]
    },
    {
        question: 'Які суб’єкти беруть участь у формуванні Конституційного Суду України?',
        answers: [
            'Президент України, Верховна Рада України, з’їзд суддів України.',
            'Президент України, Верховна Рада України, Кабінет Міністрів України.',
            'Президент України, Верховна Рада України, Верховний Суд.',
            'Президент України, Верховна Рада України, Вища рада правосуддя.'
        ]
    },
    {
        question: 'Який із наведених видів всеукраїнських референдумів є обов’язковим?',
        answers: [
            'Про затвердження законопроекту про внесення змін до розділів І, ІІІ, ХІІІ Конституції України.',
            'Про імпічмент Президента України.',
            'Про затвердження законопроекту про внесення змін до розділів ІІ, ІV, ХІІ Конституції України.',
            'Про призначення позачергових виборів до Верховної Ради України.'
        ]
    },
    {
        question: 'На виборах яких суб’єктів НЕ застосовується мажоритарна виборча система відносної більшості?',
        answers: [
            'Депутатів районних у містах рад.',
            'Депутатів сільських, селищних рад.',
            'Сільських, селищних голів.',
            'Старост.'
        ]
    },
    {
        question: 'Якому із нижчевказаних органів публічної влади належить повноваження щодо затвердження Державного бюджету України?',
        answers: [
            'Верховній Раді України.',
            'Національному банку України.',
            'Кабінету Міністрів України.',
            'Президентові України.'
        ]
    },
    {
        question: 'До повноважень якого органу публічної влади належить найменування і перейменування населених пунктів і районів?',
        answers: [
            'Верховної Ради України.',
            'Президента України.',
            'Місцевої державної адміністрації.',
            'Обласної ради.'
        ]
    },
    {
        question: 'На який строк видається посвідчення біженця?',
        answers: [
            'П’ять років.',
            'Один рік.',
            'Два роки.',
            'Три роки.'
        ]
    },
    {
        question: 'Розпорядженням Кабінету Міністрів України було призначено академічну стипендію Кабінету Міністрів України студентам вищих навчальних закладів та аспірантам. До якої із груп адміністративно-правових відносин належить вище вказана діяльність?',
        answers: [
            'Сприяльне адміністрування.',
            'Забезпечувальне адміністрування.',
            'Втручальне адміністрування.',
            'Юрисдикційне адміністрування.'
        ]
    },
    {
        question: 'Які відомості НЕ зазначаються в інформаційній картці адміністративної послуги?',
        answers: [
            'Етапи опрацювання звернення про надання адміністративної послуги.',
            'Строк надання адміністративної послуги.',
            'Можливі способи отримання відповіді (результату).',
            'Перелік документів, необхідних для отримання адміністративної послуги.'
        ]
    },
    {
        question: 'До ознак якого інструменту публічного адміністрування належить неодноразовість застосування?',
        answers: [
            'Нормативного акта.',
            'Адміністративного Договору.',
            'Індивідуального акта.',
            'Фактичної дії.'
        ]
    },
    {
        question: 'Порушенням якого принципу адміністративного права є ігнорування суб’єктом публічної адміністрації остаточного судового рішення стосовно виданого цим суб’єктом акта?',
        answers: [
            'Юридичної визначеності.',
            'Доступу до незалежного суду.',
            'Заборони дискримінації.',
            'Запобігання зловживанню повноваженнями.'
        ]
    },
    {
        question: 'На кого із зазначених осіб поширюється обмеження щодо політичної нейтральності, передбачене Законом України «Про запобігання корупції»?',
        answers: [
            'Державний секретар Кабінету Міністрів України.',
            'Сільський, селищний, міський голова.',
            'Віце-прем’єр-міністр України.',
            'Народний депутат України.'
        ]
    },
    {
        question: 'Яке із зазначених стягнень НЕ є дисциплінарним стягненням, що може застосовуватись до державних службовців?',
        answers: [
            'Штраф.',
            'Зауваження.',
            'Догана.',
            'Звільнення з посади.'
        ]
    },
    {
        question: 'До якого виду джерел адміністративного права можна віднести «Правила благоустрою міста Львів», затверджені рішенням Львівської міської ради?',
        answers: [
            'Підзаконні нормативні акти.',
            'Звичаї місцевої громади.',
            'Акти м‘якого права.',
            'Неформалізовані джерела.'
        ]
    },
    {
        question: 'Який із зазначених суб’єктів НЕ може бути членом громадської спілки?',
        answers: [
            'Юридична особа публічного права.',
            'Іноземець.',
            'Юридична особа приватного права.',
            'Військовослужбовець.'
        ]
    },
    {
        question: 'Який із наведених строків є позовною давністю?',
        answers: [
            'Строк для звернення до суду із вимогою про визнання правочину недійсним.',
            'Строк для пред’явлення виконавчого документа до виконання.',
            'Строк для заявлення кредиторами своїх вимог до юридичної особи, що ліквідується.',
            'Строк для звернення до нотаріуса за вчиненням виконавчого напису.'
        ]
    },
    {
        question: 'Чи припиняє новація додаткові зобов’язання, пов’язані з первісним зобов’язанням?',
        answers: [
            'Припиняє, якщо інше не встановлено договором.',
            'Припиняє в усіх випадках.',
            'Припиняє тільки поруку, гарантію та заставу.',
            'Не припиняє.'
        ]
    },
    {
        question: 'Як називається договір в якому одна сторона - підприємець взяла на себе обов’язок здійснювати продаж товарів, виконання робіт або надання послуг кожному, хто до неї звернеться?',
        answers: [
            'Публічний.',
            'Купівлі-продажу.',
            'Підприємницький.',
            'Господарський.'
        ]
    },
    {
        question: 'Що є підставою для визнання договору страхування недійсним?',
        answers: [
            'Укладення договору після настання страхового випадку.',
            'Недотримання істотних умов.',
            'Не настання страхового випадку.',
            'Невнесення страхувальником чергового платежу.'
        ]
    },
    {
        question: 'Кому належить право власності на об’єкт будівництва?',
        answers: [
            'Замовнику, якщо інше не передбачено договором.',
            'Підряднику, якщо інше не передбачено договором.',
            'Замовнику та підряднику спільно.',
            'Підряднику, якщо інше не передбачено законом.'
        ]
    },
    {
        question: 'Хто може бути відчужувачем за договором довічного утримання (догляду)?',
        answers: [
            'Будь-яка фізична особа.',
            'Будь-який суб’єкт цивільного права з відповідним обсягом цивільної дієздатності.',
            'Будь-яка фізична або юридична особа.',
            'Лише юридична особа.'
        ]
    },
    {
        question: 'Протягом якого строку наймодавець може висунути заперечення щодо пролонгації договору найму (оренди)?',
        answers: [
            'Одного місяця.',
            'Двох місяців.',
            'Трьох місяців.',
            'Чотирьох місяців.'
        ]
    },
    {
        question: 'У який день виникає право на спадкування?',
        answers: [
            'Коли відкрилася спадщина.',
            'Коли спадкоємець дізнався про смерть спадкодавця.',
            'Коли спадкоємець звернувся із заявою про прийняття спадщини.',
            'Коли минуло 6 місяців після відкриття спадщини.'
        ]
    },
    {
        question: 'Яким вважається договір найму квартири, укладений у письмовій формі між двома фізичними особами, якщо не зазначено строк його дії?',
        answers: [
            'Укладеним на п’ять років.',
            'Неукладеним.',
            'Укладеним на один рік.',
            'Укладеним на невизначений строк.'
        ]
    },
    {
        question: 'З якого моменту припиняється дія патенту?',
        answers: [
            'З першого дня року, за який збір не сплачено.',
            '3 дня, за який збір не сплачено.',
            'З наступного дня, що йде за ним, за який збір не сплачено.',
            'З першого дня кварталу, за який збір не сплачено.'
        ]
    },
    {
        question: 'Який вид територіальної підсудності притаманний для справ, що виникають з трудових правовідносин?',
        answers: [
            'Альтернативна.',
            'Загальна.',
            'Виключна.',
            'Договірна.'
        ]
    },
    {
        question: 'Пархоменко проживав в ОСББ. Він вважав, що йому були неналежно надані житлово-комунальні послуги. Він подав заяву про видачу судового наказу. Як має вчинити суддя?',
        answers: [
            'Відмовити у видачі судового наказу.',
            'Відкрити провадження.',
            'Залишити заяву без розгляду.',
            'Повернути заяву.'
        ]
    },
    {
        question: 'Що НЕ належить до основних засад судочинства, визначених Конституцією України?',
        answers: [
            'Заборона впливу на суддю у будь-який спосіб.',
            'Рівність усіх учасників судового процесу перед законом і судом.',
            'Розумні строки розгляду справи судом.',
            'Гласність судового процесу та його повне фіксування технічними засобами.'
        ]
    },
    {
        question: 'За якої умови суддя, який під час попереднього вирішення цієї справи брав участь у процесі, може брати участь у розгляді цієї справи і НЕ підлягає відводу (самовідводу)?',
        answers: [
            'Він брав участь у процесі як судовий розпорядник.',
            'Він брав участь у процесі як перекладач.',
            'Він брав участь у процесі як представник.',
            'Він брав участь у процесі як секретар судового засідання.'
        ]
    },
    {
        question: 'В якому випадку за результатами підготовчого провадження суд ухвалює рішення?',
        answers: [
            'Відповідач визнав позов.',
            'Відсутні заперечення відповідача.',
            'Позов обґрунтований і доведений.',
            'Відповідач не подав відзив.'
        ]
    },
    {
        question: 'На якій стороні може вступити у справу третя особа без самостійних вимог щодо предмета спору?',
        answers: [
            'На стороні позивача або відповідача.',
            'Тільки на стороні позивача.',
            'На стороні будь-якого учасника судового процесу.',
            'Тільки на стороні відповідача.'
        ]
    },
    {
        question: 'В якому випадку проведення врегулювання спору за участю судді НЕ допускається?',
        answers: [
            'У справу вступила третя особа, яка заявляє самостійні вимоги щодо предмета спору.',
            'У справу вступила третя особа, яка не заявляє самостійні вимоги щодо предмета спору.',
            'Вимога позивача стосується визнання незаконною приватизації державного житлового фонду.',
            'Вимога позивача є очевидно безпідставною або не підтверджується наявними у справі доказами.'
        ]
    },
    {
        question: 'На якому доказі НЕ може ґрунтуватися рішення у справі щодо правочину, вчиненого з порушенням письмової форми, якщо Друга сторона оспорює факт його вчинення?',
        answers: [
            'Показання свідка.',
            'Розписка.',
            'Аудіозапис.',
            'Відеозапис.'
        ]
    },
    {
        question: 'Якими є межі розгляду справи апеляційним судом?',
        answers: [
            'Суд апеляційної інстанції обмежений доводами та вимогами апеляційної скарги.',
            'Суд апеляційної інстанції самостійно встановлює межі розгляду залежно від конкретної справи.',
            'Суд апеляційної інстанції не обмежений доводами апеляційної скарги та вимогами, заявленими у суді І інстанції.',
            'Суд апеляційної інстанції завжди перевіряє справу в повному обсязі.'
        ]
    },
    {
        question: 'Дружина звернулася до чоловіка про стягнення аліментів у розмірі 1000 грн. щомісячно. Як вирішується питання із сплатою судового збору при зверненні до суду?',
        answers: [
            'Вона звільнена від сплати судового збору.',
            'Вона сплачує судовий збір.',
            'За клопотанням суд має право звільнити її від сплати судового збору.',
            'Вона сплачує судовий збір, але суд може розстрочити сплату.'
        ]
    },
    {
        question: 'Що належить до сфери регулювання Цивільного процесуального кодексу?',
        answers: [
            'Порядок вирішення судами майнових спорів між громадянами.',
            'Розгляд скарг на дії посадової особи виконкому міської ради.',
            'Порядок розгляду спорів пов’язаних з господарськими договорами.',
            'Розгляд скарг на незаконне звільнення з публічної служби.'
        ]
    },
    {
        question: 'Які існують дві обов’язкові умови кримінальної відповідальність за злочинну бездіяльність?',
        answers: [
            'Обов’язок діяти певним чином та наявність реальної можливості діяти таким чином.',
            'Нормативний припис діяти в конкретних умовах та настання суспільно небезпечних наслідків.',
            'Право вчинити певну дію та передбачення можливості настання суспільно небезпечних наслідків.',
            'Наявність реальної можливості діяти та усвідомлення можливості діяти в такий спосіб.'
        ]
    },
    {
        question: 'У котрій із відповідей наведено ознаки юридичного критерію неосудності?',
        answers: [
            'Інтелектуальна і вольова.',
            'Матеріальна і формальна.',
            'Медична і психологічна.',
            'Юридична і психологічна.'
        ]
    }
]
    
    export { law };