// Перша відповідь правильна всередині масиву

let medicine = [
    {
        question: 'Хворий М. 25 р. доставлений в операційну для виконання операції з приводу варикозного розширення вен нижніх кінцівок. Коли можна починати хірургічне втручання?',
        answers: [
            'На 2-му рівні ІІІ стадії наркозу',
            'На ІІ стадії наркозу',
            'На 3-му рівні ІІІ стадії наркозу',
            'На 4-му рівні ІІІ стадії наркозу'
        ]
    },
    {
        question: 'Хвору К. 38 р. госпіталізовано в травматологічне відділення після дорожньо-транспортної пригоди з переломом та зміщенням шийних хребців. Який ви застосуєте метод витягнення?',
        answers: [
            'Петлею Гліссона  ',
            'Лямками  ',
            'Спіральною клемою  ',
            'Хребтове витягнення  '
        ]
    },
    {
        question: 'У медпункт заводу звернулась жінка М. 43 р., зі скаргами на різкий біль, свербіння, відчуття жару в лівій гомілці. Температура тіла 38,3°С, хворіє два дні. Об’єктивно: в ділянці гомілки виражений набряк, розлите почервоніння з чіткими фестончастими краями, є окремі пухирі, наповнені жовтуватим вмістом. Ваш  попередній діагноз?',
        answers: [
            'Бешиха ',
            'Сибірка  ',
            'Опік  ',
            'Газова гангрена  '
        ]
    },
    {
        question: 'До вас звернулася жінка О. 38 р. зі скаргами на біль у лівій гомілці. Страждає варикозним розширенням вен нижніх кінцівок протягом 3-х років після пологів.  Об’єктивно: температура тіла 38°С. У ділянці лівої гомілки по ходу варикозно розширених вен пальпуються болючі тяжі, шкіра над ними гіперемована, набрякла. Який попередній діагноз?',
        answers: [
            'Тромбофлебіт ',
            'Ендартеріїт  ',
            'Атеросклероз   ',
            'Варикоз  '
        ]
    },
    {
        question: 'У результаті падіння при аварії в мотоцикліста, поранення правої гомілки. Об’єктивно: стан середньої важкості. Блідість шкірних покривів виражена. Стогне від болю в нозі. Пульс- 110/хв., АТ- 90/60 мм рт.ст. Свідомість не втрачав. У рані уламки, кровотеча незначна. Який ступінь шоку?',
        answers: [
            'ІІ',
            'I',
            'Ia',
            'III'
        ]
    },
    {
        question: 'У хірургічний кабінет  поліклініки  звернулась жіінка А. 45 р., яка хворіє варикозним розширенням вен 8 років. Об\'єктивно: гігіантська виразка, що охоплює всю нижню третину лівої гомілки, з в\'ялими грануляціями. Шкіра навколо неї туга, має темні плями. Ваш  попередній діагноз?',
        answers: [
            'Трофічна виразка   ',
            'Атеросклеротична виразка  ',
            'Променева виразка  ',
            'Туберкульозна виразка  '
        ]
    },
    {
        question: 'Ви акушерка приймально-діагностичного відділення оглядаєте жінку, 35 років, після кримінального аборту. Ви повинні провести специфічну профілактику проти якої хірургічної інфекції:  ',
        answers: [
            'Правця  ',
            'Бешихи  ',
            'Сказу  ',
            'Гангрени  '
        ]
    },
    {
        question: 'Ви працюєте в хірургічному відділенні. За призначенням лікаря готуєте пацієнтку до оперативного втручання з приводу гострого апендициту. Вкажіть термін підготовки до ургентної операції: ',
        answers: [
            '2 години  ',
            '12 годин',
            '6 годин  ',
            'Негайно'
        ]
    },
    {
        question: 'При огляді хворого стан тяжкий. Діагностовано відкритий пневмоторакс. Лікар доручив накласти повязку. Якого типу вона повинна бути?  ',
        answers: [
            'Оклюзійна   ',
            'Давляча',
            'Спіральна   ',
            'Черепашача  '
        ]
    },
    {
        question: 'Який засіб іммобілізації для транспортування в травматологічне відділення треба надати чоловіку з деформацією в ділянці лівого стегна, який потратив під обвал.',
        answers: [
            'Шина пневматична',
            'Шина Беллера  ',
            'Шина Ентіна',
            'Шина Єланського  '
        ]
    },
    {
        question: 'ікар призначив накласти герметичну пов’язку потерпілому з відкритим пневмотораксом. Яка з пов’язок буде герметична?',
        answers: [
            'Оклюзійна',
            'Колосоподібна  ',
            'Вельпо   ',
            'Дезо   '
        ]
    },
    {
        question: 'Яке втручання є доцільним на догоспітальному етапі, якщо чоловік отримав опік крутим окропом лівої кисті та передпліччя, скаржиться на сильний біль. При огляді: на тильній поверхні лівої кисті та передпліччя пухирі:  ',
        answers: [
            'Охолодити, накласти асептичну пов’язку    ',
            'Накласти мазеву пов’язку  ',
            'Накласти оцтовий компрес  ',
            'Порадити прикласти грілку  '
        ]
    },
    {
        question: 'Який метод хірургічної обробки рук використовують при відсутності води:  ',
        answers: [
            'Бруна',
            'Альфельда  ',
            'Гроссіха-Філончикова  ',
            'Спасокукоцького-Кочергіна  '
        ]
    },
    {
        question: 'При визначенні групи крові за допомогою стандартних сироваток хворій М, 30 р., аглютинація з’явилась в І і ІІІ лунках. Яка група крові у пацієнтки:  ',
        answers: [
            'А[ІІ]',
            '0[І]  ',
            'АВ[ІV]  ',
            'В[ІІІ]  '
        ]
    },
    {
        question: 'Акушерка виконує функцію операційної сестри. Який вид прибирання операційної застосувати перед початком кожного операційного дня:  ',
        answers: [
            'Попереднє',
            'Заключне  ',
            'Поточне  ',
            'Генеральне   '
        ]
    },
    {
        question: 'Який із перерахованих препаратів має бути обов’язково введений при підготовці до операції:  ',
        answers: [
            'Холінолітик - атропіну сульфат',
            'Нейролептик - аміназин  ',
            'Транквілізатор - діазепам  ',
            'Снодійне - фенобарбітал   '
        ]
    },
    {
        question: 'Що характерно для злоякісної пухлини',
        answers: [
            'Пухлина проростає в сусідні органи',
            'Пухлина не дає метастазів  ',
            'Пухлина не здавлює сусідні органи  ',
            'Пухлина відокремлена капсулою  '
        ]
    },
    {
        question: 'Яку пробу слід провести для виявлення залишків крові при проведенні передстерилізаційної обробки інструментарію:  ',
        answers: [
            'Азопірамову',
            'Сулемову   ',
            'Тимолову   ',
            'Фенолфталеїнову  '
        ]
    },
    {
        question: 'Яке з перелічених трансфузійних середовищ є найкращим для переливання хворій з крововтратою:',
        answers: [
            'Еритроцитарна маса',
            'Плазма  ',
            'Лейкоцитарна маса',
            'Гемодез  '
        ]
    },
    {
        question: 'Що потрібно зробити, якщо перед транспортуванням до лікарні потерпілому наклали джгут, але термін накладання закінчився раніше госпіталізації:  ',
        answers: [
            'Джгут послабити, пальцеве притискання, повторно накласти джгут',
            'Джгут зняти, ввести кровоспинні засоби  ',
            'Ввести серцеві засоби та продовжити транспортування',
            'Продовжити транспортування з накладеним джгутом  '
        ]
    },
    {
        question: 'Яка Ваша тактика, якщо у хворого 50 років 3 години тому виникло защемлення пахової грижі:   ',
        answers: [
            'Холод на живіт та транспортування до лікарні',
            'Ввести знеболюючі засоби',
            'Зрошення грижового випинання хлоретилом  ',
            'Ручне вправлення грижі  '
        ]
    },
    {
        question: 'Породілля скаржиться на біль в правій грудній залозі. В ділянці болю інфільтрат 3х4 см, з розм’якшенням у центрі. Температура 38,5оС. Який найбільш вірогідний діагноз?',
        answers: [
            'Гнійний мастит',
            'Пневмонія',
            'Плеврит  ',
            'Гострий лактостаз'
        ]
    },
    {
        question: 'Ви працюєте в операційній. Необхідно простерилізувати інструмент хімічним способом  в 6% розчині пероксиду водню. Який час тримає стерилізація при кімнатній температурі?',   
        answers: [
            '6 годин',
            '2 години  ',
            '4 години  ',
            '8 годин  '
        ]
    },
    {
        question: 'У жінки 50 років, хворої  на варикозну хворобу нижніх кінцівок, внаслідок поранення виникла кровотеча. Кров темного кольору. Як зупинити кровотечу в даному випадку?   ',
        answers: [
            'Накласти давлючу пов’язку.',
            'Накласти джгут.  ',
            'Виконати тампонаду рани.  ',
            'Ввести кровоспинні препарати  '
        ]
    },
    {
        question: 'При масивних переливаннях крові  необхідно проводити профілактику цитратного шоку. Який препарат застосовується при цьому?   ',
        answers: [
            '10% розчин кальцію хлориду',
            '10% розчин натрію хлориду',
            '0,9% розчин натрію хлориду',
            '25% розчин сульфату магнію'
        ]
    },
    {
        question: '	У пацієнта різана рана тильної поверхні кисті з гнійним  ексудатом, отримана  3 дні тому. Для перев’язки Ви  приготували лікарю 1% р-н йодонату для обробки шкіри. Які ще розчини необхідні  для цієї перев’язки?',
        answers: [
            '3% водню пероксиду та 10% натрію хлориду',
            '1% хлораміну та 10% натрію хлориду',
            '0,02% фурациліну та 0,9% натрію хлориду',
            '6% водню пероксиду та 0,02% фурациліну'
        ]
    },
    {
        question: 'Через 6 діб після ін’єкції у породіллі утворився різко болючий інфільтрат з гіперемією шкіри над ним, місцевим підвищенням температури. Температура тіла- 37,8оС. Що у пацієнтки?',
        answers: [
            'Пост’єкційний абсцес',
            'Карбункул  ',
            'Флегмона  ',
            'Панарицій  '
        ]
    },
    {
        question: 'При проведенні огляду 25 річної жінки у відділенні профілактики ви виявили щільний вузол діаметром до 2 см в правій молочній залозі. Ваші незалежні втручання:  ',
        answers: [
            'Направити до хірурга або мамолога',
            'Провести масаж молочної залози  ',
            'Порадити компреси з димексидом  ',
            'Запропонувати фізіопроцедури  '
        ]
    },
    {
        question: 'Пацієнтка готується до гінекологічної операції. Якими інструментами фіксують білизну навколо операційної рани?  ',
        answers: [
            'Цапками',
            'Корнцангами  ',
            'Голками  ',
            'Затискачами Люера  '
        ]
    },
    {
        question: 'Невідомий спричинив чоловікові удар ножем у живіт. При обстеженні на передній черевній стінці рана довжиною 5 см, яка помірно кровоточить, в її отвір випала петля кишківника. Турбують біль у животі і спрага. Що необхідно виконати на місці в першу чергу?  ',
        answers: [
            'Hакласти вологу серветку на петлі, зафіксувати їх, знеболити    ',
            'Вправити петлі кишківника в черевну порожнину  ',
            'Обробити петлі кишківника дез.розчином, вправити  ',
            'Ввести кровозупинні, знеболюючі, госпіталізувати'
        ]
    },
    {
        question: 'У пацієнта закритий перелом кісток гомілки. Що необхідно приготувати для транспортної іммобілізації?  ',
        answers: [
            'Шини Крамера',
            'Бинт для пов’язки Дезо  ',
            'Шину Дітеріхса  ',
            'Косинку для пов’язки  '
        ]
    },
    {
        question: 'Пацієнтку готують до ургентної операції - кесаревого розтину. За призначенням лікаря Вам необхідно підготувати препарати для премедикації. Який препарат є обов’язковим для її проведення?  ',
        answers: [
            'Атропін',
            'Анальгін  ',
            'Аміназин  ',
            'Клофелін  '
        ]
    },
    {
        question: 'Потерпілий збитий вантажівкою. На передній поверхні правого передпліччя є глибока рана, у глибині якої уламки обох кісток.  Що необхідно зробити в першу чергу при наданні невідкладної допомоги?  ',
        answers: [
            'Зупинити кровотечу',
            'Накласти асептичну пов’язку',
            'Накласти транспортну шину  ',
            'Зігріти потерпілого  '
        ]
    },
    {
        question: 'Пацієнтці планується оперативне втручання - ампутація нижньої кінцівки. Яке втручання потрібно виконати за 30 хвилин до початку операції?    ',
        answers: [
            'Виконати премедикацію',
            'Виконати очисну клізму    ',
            'Дати гіпотензивні ліки    ',
            'Поголити операційне поле    '
        ]
    },
    {
        question: 'У пацієнта після проведення біологічної проби при переливанні крові з’явилися занепокоєння, загрудинний стискаючий біль, страх, холодний піт, блідість шкірних покривів. Які першочергові втручання необхідно виконати?  ',
        answers: [
            'Негайно припинити переливання крові',
            'Ввести хворому антигістамінні препарати    ',
            'Негайно ввести протишокові препарати    ',
            'Негайно ввести серцево-судинні засоби    '
        ]
    },
    {
        question: 'У хворого раптово виник біль в ділянці попереку, який іррадіює вниз живота і статеві органи, посилюється при рухах, сечопуск утруднений, болючий. Це характерно для:    ',
        answers: [
            'Ниркової кольки',
            'Перфоративної виразки шлунку     ',
            'Апендициту',
            'Гострого холециститу    '
        ]
    },
    {
        question: 'Для різаної рани характерні краї:    ',
        answers: [
            'Рівні',
            'Злиплі  ',
            'Нерівні    ',
            'Обпалені '
        ]
    },
    {
        question: 'Вражаючі фактори блискавки:    ',
        answers: [
            'Електричний струм',
            'Світлова енергія    ',
            'Звукова енергія    `',
            'Проникаюча радіація    '
        ]
    },
    {
        question: 'У пацієнта облітеруючий ендартеріїт обох нижніх кінцівок. Яку найхарактернішу проблему Ви виявите у хворого?    ',
        answers: [
            'Переміжна кульгавість',
            'Біль у суглобах    ',
            'Синюшність стоп    ',
            'Набряк гомілок    '
        ]
    },
    {
        question: 'У хірургічному відділенні знаходиться хворий після операції резекції шлунку. Що необхідно зробити в першу чергу для профілактики застійної пневмонії?     ',
        answers: [
            'Проводити дихальну гімнастику',
            'Надати сидячого положення    ',
            'Дотримуватись суворого ліжкового режиму   ',
            'Вводити сечогінні    '
        ]
    }
]
    
    export { medicine };