import window1 from '../images/tests/programming/window1.jpg';

// Correct answer goes first
let programming = [
  {
    question: 'Як називається спрощене представлення реального об\'єкта, процесу аба явища? ',
    answers: [
      'Модель',
      'Ескіз',
      'Алгоритм',
      'Програма',
    ],
  },
  {
    question: 'Модель зберігає...',
    answers: [
      'Істотні властивості об\'єкта оригіналу',
      'Усі властивості об\'єкта',
      'Тільку одну із властивостей об\'єкта',
      'Масив власитвостей',
    ],
  },
  {
    question: 'До якої категорії належить модель, створена для дослідження процесів або явищ?',
    answers: [
      'Науково-технічної',
      'Матеріальної',
      'Ігрової',
      'Фізико-математичної',
    ],
  },
  {
    question: 'Яку модель називають вербальною?',
    answers: [
      'Інформаційну модель, виражену в уявній і різномовній формі',
      'Інформаційну модель, виражену спеціальними знаками',
      'Сукупність інформації, що характеризує властивості й стан об\'єкта; процесу, явища, а також взаємозв\'язок із навколишнім світом',
      'Інформаційну модель, яку можна описати словами',
    ],
  },
  {
    question: 'Яку модель називають інформаційною?',
    answers: [
      'Сукупність інформації, що характеризує властивості та стан об\'єкта, процесу, явища; а також взаємозв\'язок із навколишнім світом',
      'Інформаційну модель, виражену в уявній і різномовній формі',
      'Модель, виражену спеціальними знаками',
      'Інформаційну модель, яку можна описати словами',
    ],
  },
  {
    question: 'З урахуванням фактора часу моделі поділяються на ...',
    answers: [
      'Динамічні та статичні',
      'Матеріальні та інформаційні',
      'Вербальні та знакові',
      'Лінійні та скалярні',
    ],
  },
  {
    question: 'Що таке математичні моделі?',
    answers: [
      'Знакові, знакові на формальних мовах',
      'Послідовність речень, які використовують на формалізованих діалектах',
      'Моделі, які описують інформаційні процеси',
      'Моделі, зміст який можна передати через математичну функцію',
    ],
  },
  {
    question: 'Літери кирилиці у програмі...',
    answers: [
      'Можна використовувати тільки в коментарях',
      'Можна використовувати іноді в ідентифікаторах',
      'Не можна використовувати',
      'Можна використовувати в змінних',
    ],
  },
  {
    question: 'Яким ключовим словом починається розділ опису змінних? ',
    answers: [
      'const',
      'type',
      'var',
      'foo',
    ],
  },
  {
    question: 'Як називається етап розв\'язання задач на ЕОМ, коли написана програма перевіряється за певних вхідних даних на одержання попереднього відомого результату?  ',
    answers: [
      'Тестування',
      'Налагодження',
      'Алгоритмізація задачі',
      'Легалізація',
    ],
  },
  {
    question: 'Результат виконання операції 1div 5 дорівнює...',
    answers: [
      '0',
      '1',
      '0.2',
      'NaN',
    ],
  },
  {
    question: 'Результат виконання операції 10/3 дорівнює...',
    answers: [
      '3,3333',
      '3',
      '1',
      'NaN',
    ],
  },
  {
    question: 'Алгоритм опрацювання даних, записаний спеціальною мовою та призначений для виконання комп’ютером назівається ...',
    answers: [
      'комп\'ютерною програмою',
      'прикладною програмою',
      'навчальною програмою',
      'інтерфейсом',
    ],
  },
  {
    question: 'Головний компонент програми на якому можна розмістити різні компоненти називається ...',
    answers: [
      'формою',
      'написом',
      'кнопкою',
      'полем',
    ],
  },
  {
    question: 'Що з наведеного не є складовими мови програмування?',
    answers: [
      'Дані',
      'Семантика',
      'Словник',
      'Синтаксис',
    ],
  },
  {
    question: 'До якої групи відноситься мова програмування Object Pascal',
    answers: [
      'високого рівня',
      'візуального програмування',
      'низького рівня',
      'машинного рівня',
    ],
  },
  {
    question: 'На рисунку вікно Інспектора об’єктів позначено цифрою ...',
    imageSrc: window1,
    imageAlt: 'вікно Інспектора',
    answers: [
      '4',
      '3',
      '2',
      '1',
    ],
  },
  {
    question: 'Порушення правил складання і запису мовних конструкцій називається ...',
    answers: [
      'синтаксичною помилкою',
      'семантичною помилкою',
      'орфографічною помилкою',
      'логічною помилкою',
    ],
  },
  {
    question: 'На рисунку вікно Редактора тексту позначено цифрою ...',
    imageSrc: window1,
    imageAlt: 'вікно Редактора',
    answers: [
      '3',
      '2',
      '1',
      '4',
    ],
  },
  {
    question: 'Чому відео та аудіо для людини є найбільш інформативними?',
    answers: [
      'Понад 90 % інформації людина сприймає зором і слухом',
      'Людина окрім відео- і аудіоповідомлень нічого більше не сприймає',
      'Люди порівняно довго дивляться телевізор',
      'Існують комп’ютери ',
    ],
  },
  {
    question: 'Цифрове відео «стискають» для того, щоб: ',
    answers: [
      'зменшити обсяг відеофайлів',
      'підвищити якість зображення у фільмі',
      'мати можливість озвучувати фільми',
      'фільми були кольоровими',
    ],
  },
  {
    question: 'Як називається звукозапис на грамплатівці?',
    answers: [
      'Аналоговий ',
      'Дискретний ',
      'Багатоканальний ',
      'Цифровий ',
    ],
  },
  {
    question: 'Які формати призначені для відеофайлів? ',
    answers: [
      '.avi ',
      '.mp3 ',
      '.jpg ',
      '.jsx',
    ],
  },
  {
    question: 'Яке призначення програми-аудіоредактора?',
    answers: [
      'Редагування аудіофайлів',
      'Відтворення аудіофайлів ',
      'Перегляд кіно ',
      'Передавання аудіофайлів мережею ',
    ],
  },
  {
    question: 'Яка стандартна програма запису звуку в Windows?',
    answers: [
      'Звукозапис ',
      'Медіаплеєр ',
      'Аудіоплеєр ',
      'MovieMaker ',
    ],
  },
  {
    question: 'Як називають процес перетворення відеосигналу із зовнішнього пристрою в цифровий формат і запис його у відеофайл?',
    answers: [
      'Захоплення відео ',
      'Конвертування відео ',
      'Трансляція відео ',
      'Відтворення відео',
    ],
  },
  {
    question: 'Скінченна послідовність команд, виконання яких приводить до поставленої мети та отримання результату називається...',
    answers: [
      'Алгоритм',
      'Програма',
      'Блок-схема',
      'Команда',
    ],
  },
  {
    question: ' Алгоритм опрацювання даних, записаний спеціальною мовою та призначений для виконання комп\'ютером називають ...',
    answers: [
      'Комп\'ютерна програма',
      'Блок-схема',
      'Проект',
      'Скретч',
    ],
  },
  {
    question: 'Оберіть умовні висловлювання:',
    answers: [
      'Якщо-то',
      'Повторювати поки',
      'Завжди',
      'Повторити n разів',
    ],
  },
  {
    question: 'Основне призначення функцій графічного редактора:',
    answers: [
      'опрацювання зображень',
      'побудова діаграм',
      'створення анімації',
      'редагування формул',
    ],
  },
  {
    question: 'Параметр, що характеризує растрове графічне зображення:',
    answers: [
      'роздільна здатність',
      'розмір зображення',
      'об’єм файлу',
      'колірна модель',
    ],
  },
  {
    question: 'Вид графіки, при якій зображення будується з подібних між собою елементів:',
    answers: [
      'фрактальна',
      'динамічна',
      'растрова',
      'монохромна',
    ],
  },
  {
    question: 'Вид графіки, при якій зображення подається у двох кольорах:',
    answers: [
      'монохромна',
      'двоколірна',
      'динамічна',
      'статична',
    ],
  },
  {
    question: 'Укажіть вид графічного редактора, вбудованого у прикладні програми Microsoft:',
    answers: [
      'векторний',
      'тривимірний',
      'растровий',
      'динамічний',
    ],
  },
  {
    question: 'Які типи зв’язків можуть існувати між таблицями базами даних?',
    answers: [
      '«один за всіх і всі за одного»',
      '«один до кожного», «кожен до багатьох», і «багато до всіх»',
      '«один до одного», «один до багатьох», і «багато до багатьох»',
      '«один до жодного», «один до двох», і «багато до багатьох»',
    ],
  },
  {
    question: 'Яка основна характеристика полів?',
    answers: [
      'кількість',
      'тип даних',
      'ширина',
      'достовірність даних',
    ],
  },
  {
    question: 'Які об\'єкти призначені для введення та перегляду даних?',
    answers: [
      'таблиці',
      'звіти',
      'запити',
      'зв\'язки',
    ],
  },
  {
    question: 'Як називаються стовпчики в таблицях бази даних?',
    answers: [
      'поля',
      'кортежі',
      'записи',
      'відношення',
    ],
  },
  {
    question: 'Як називаються рядки в таблицях бази даних?',
    answers: [
      'поля',
      'атрибути',
      'записи',
      'відношення',
    ],
  },
  {
    question: 'Що таке СУБД?',
    answers: [
      'скорочення від слів Система Управління Базами Даних',
      'скорочення від слів Система утримання Баз Даних',
      'скорочення від слів Структура Управління Базами Даних',
      'скорочення від слів Система Управління Базисами Даних',
    ],
  },
];
    
export { programming };